In [41]:
import pandas as pd 
import numpy as np

In [42]:
indian_weather = pd.DataFrame({
    "city" : ["mumbai","delhi","banglore"],
    "temp" : [23,37,30],
    "humidirty" : [89,70,65]
}
)
us_weather = pd.DataFrame({
    "city" : ["new york","chicago","orlango"],
    "temp" : [13,34,23],
    "humidirty" : [81,72,45]
}
)

In [43]:
indian_weather

       city  temp  humidirty
0    mumbai    23         89
1     delhi    37         70
2  banglore    30         65

In [44]:
us_weather

       city  temp  humidirty
0  new york    13         81
1   chicago    34         72
2   orlango    23         45

### concatinate data Frame

In [45]:
df = pd.concat([indian_weather,us_weather])
df

       city  temp  humidirty
0    mumbai    23         89
1     delhi    37         70
2  banglore    30         65
0  new york    13         81
1   chicago    34         72
2   orlango    23         45

to fix index

In [46]:
df = pd.concat([indian_weather,us_weather],ignore_index = True)
df

       city  temp  humidirty
0    mumbai    23         89
1     delhi    37         70
2  banglore    30         65
3  new york    13         81
4   chicago    34         72
5   orlango    23         45

In [47]:
df = pd.concat([indian_weather,us_weather],keys = ["india","us"])
# serial matters 
df

             city  temp  humidirty
india 0    mumbai    23         89
      1     delhi    37         70
      2  banglore    30         65
us    0  new york    13         81
      1   chicago    34         72
      2   orlango    23         45

In [48]:
print(df.loc["india"])
print(df.loc["us"])

       city  temp  humidirty
0    mumbai    23         89
1     delhi    37         70
2  banglore    30         65
       city  temp  humidirty
0  new york    13         81
1   chicago    34         72
2   orlango    23         45

In [49]:
print(df.loc["us"])

       city  temp  humidirty
0  new york    13         81
1   chicago    34         72
2   orlango    23         45

In [50]:
humidity_data = pd.DataFrame({
    "city" : ["mumbai","delhi","banglore"],
    "humidirty" : [89,70,65]
}
)
temp_data = pd.DataFrame({
    "city" : ["delhi","mumbai","banglore"],
    "temp" : [13,34,23],
}
)

In [51]:
df = pd.concat([humidity_data,temp_data])
df

       city  humidirty  temp
0    mumbai       89.0   NaN
1     delhi       70.0   NaN
2  banglore       65.0   NaN
0     delhi        NaN  13.0
1    mumbai        NaN  34.0
2  banglore        NaN  23.0

want to append column wise

In [52]:
df = pd.concat([humidity_data,temp_data],axis = 1)
df

       city  humidirty      city  temp
0    mumbai         89     delhi    13
1     delhi         70    mumbai    34
2  banglore         65  banglore    23

order is misplaces not wrong but , missleading , include index parameter

In [53]:
humidity_data = pd.DataFrame({
    "city" : ["mumbai","delhi","banglore"],
    "humidirty" : [89,70,65]
},index = [0,1,2]
)
temp_data = pd.DataFrame({
    "city" : ["delhi","mumbai","banglore"],
    "temp" : [13,34,23],
},index = [1,0,2]
)

In [54]:
df = pd.concat([humidity_data,temp_data],axis = 1)
df

       city  humidirty      city  temp
0    mumbai         89    mumbai    34
1     delhi         70     delhi    13
2  banglore         65  banglore    23

In [56]:
df = pd.concat([humidity_data,temp_data],axis = 1)
df

       city  humidirty      city  temp
0    mumbai         89    mumbai    34
1     delhi         70     delhi    13
2  banglore         65  banglore    23

In [57]:
df = pd.concat([humidity_data,temp_data],axis = 1,keys =["humidity","temperature"])
df

   humidity           temperature
       city humidirty        city temp
0    mumbai        89      mumbai   34
1     delhi        70       delhi   13
2  banglore        65    banglore   23

### concate dataframe with series

In [62]:
s = pd.Series(["rain","humid","snowfall"],name = "condition")
df = pd.concat([temp_data,s],axis = 1)
df

       city  temp condition
1     delhi    13     humid
0    mumbai    34      rain
2  banglore    23  snowfall